TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_aux_timer2.h
/******************************************************************************
*  Filename:       hw_aux_timer2_h
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_AUX_TIMER2_H__
#define __HW_AUX_TIMER2_H__

//*****************************************************************************
//
// This section defines the register offsets of
// AUX_TIMER2 component
//
//*****************************************************************************
// Timer Control
#define AUX_TIMER2_O_CTL                                            0x00000000

// Target
#define AUX_TIMER2_O_TARGET                                         0x00000004

// Shadow Target
#define AUX_TIMER2_O_SHDWTARGET                                     0x00000008

// Counter
#define AUX_TIMER2_O_CNTR                                           0x0000000C

// Clock Prescaler Configuration
#define AUX_TIMER2_O_PRECFG                                         0x00000010

// Event Control
#define AUX_TIMER2_O_EVCTL                                          0x00000014

// Pulse Trigger
#define AUX_TIMER2_O_PULSETRIG                                      0x00000018

// Channel 0 Event Configuration
#define AUX_TIMER2_O_CH0EVCFG                                       0x00000080

// Channel 0 Capture Configuration
#define AUX_TIMER2_O_CH0CCFG                                        0x00000084

// Channel 0 Pipeline Capture Compare
#define AUX_TIMER2_O_CH0PCC                                         0x00000088

// Channel 0 Capture Compare
#define AUX_TIMER2_O_CH0CC                                          0x0000008C

// Channel 1 Event Configuration
#define AUX_TIMER2_O_CH1EVCFG                                       0x00000090

// Channel 1 Capture Configuration
#define AUX_TIMER2_O_CH1CCFG                                        0x00000094

// Channel 1 Pipeline Capture Compare
#define AUX_TIMER2_O_CH1PCC                                         0x00000098

// Channel 1 Capture Compare
#define AUX_TIMER2_O_CH1CC                                          0x0000009C

// Channel 2 Event Configuration
#define AUX_TIMER2_O_CH2EVCFG                                       0x000000A0

// Channel 2 Capture Configuration
#define AUX_TIMER2_O_CH2CCFG                                        0x000000A4

// Channel 2 Pipeline Capture Compare
#define AUX_TIMER2_O_CH2PCC                                         0x000000A8

// Channel 2 Capture Compare
#define AUX_TIMER2_O_CH2CC                                          0x000000AC

// Channel 3 Event Configuration
#define AUX_TIMER2_O_CH3EVCFG                                       0x000000B0

// Channel 3 Capture Configuration
#define AUX_TIMER2_O_CH3CCFG                                        0x000000B4

// Channel 3 Pipeline Capture Compare
#define AUX_TIMER2_O_CH3PCC                                         0x000000B8

// Channel 3 Capture Compare
#define AUX_TIMER2_O_CH3CC                                          0x000000BC

//*****************************************************************************
//
// Register: AUX_TIMER2_O_CTL
//
//*****************************************************************************
// Field:     [6] CH3_RESET
//
// Channel 3 reset.
//
// 0: No effect.
// 1: Reset CH3CC, CH3PCC, CH3EVCFG, and CH3CCFG.
//
// Read returns 0.
#define AUX_TIMER2_CTL_CH3_RESET                                    0x00000040
#define AUX_TIMER2_CTL_CH3_RESET_BITN                                        6
#define AUX_TIMER2_CTL_CH3_RESET_M                                  0x00000040
#define AUX_TIMER2_CTL_CH3_RESET_S                                           6

// Field:     [5] CH2_RESET
//
// Channel 2 reset.
//
// 0: No effect.
// 1: Reset CH2CC, CH2PCC, CH2EVCFG, and CH2CCFG.
//
// Read returns 0.
#define AUX_TIMER2_CTL_CH2_RESET                                    0x00000020
#define AUX_TIMER2_CTL_CH2_RESET_BITN                                        5
#define AUX_TIMER2_CTL_CH2_RESET_M                                  0x00000020
#define AUX_TIMER2_CTL_CH2_RESET_S                                           5

// Field:     [4] CH1_RESET
//
// Channel 1 reset.
//
// 0: No effect.
// 1: Reset CH1CC, CH1PCC, CH1EVCFG, and CH1CCFG.
//
// Read returns 0.
#define AUX_TIMER2_CTL_CH1_RESET                                    0x00000010
#define AUX_TIMER2_CTL_CH1_RESET_BITN                                        4
#define AUX_TIMER2_CTL_CH1_RESET_M                                  0x00000010
#define AUX_TIMER2_CTL_CH1_RESET_S                                           4

// Field:     [3] CH0_RESET
//
// Channel 0 reset.
//
// 0: No effect.
// 1: Reset CH0CC, CH0PCC, CH0EVCFG, and CH0CCFG.
//
// Read returns 0.
#define AUX_TIMER2_CTL_CH0_RESET                                    0x00000008
#define AUX_TIMER2_CTL_CH0_RESET_BITN                                        3
#define AUX_TIMER2_CTL_CH0_RESET_M                                  0x00000008
#define AUX_TIMER2_CTL_CH0_RESET_S                                           3

// Field:     [2] TARGET_EN
//
// Select counter target value.
//
// You must select TARGET to use shadow target functionality.
// ENUMs:
// TARGET                   TARGET.VALUE
// CNTR_MAX                 65535
#define AUX_TIMER2_CTL_TARGET_EN                                    0x00000004
#define AUX_TIMER2_CTL_TARGET_EN_BITN                                        2
#define AUX_TIMER2_CTL_TARGET_EN_M                                  0x00000004
#define AUX_TIMER2_CTL_TARGET_EN_S                                           2
#define AUX_TIMER2_CTL_TARGET_EN_TARGET                             0x00000004
#define AUX_TIMER2_CTL_TARGET_EN_CNTR_MAX                           0x00000000

// Field:   [1:0] MODE
//
// Timer mode control.
//
// The timer restarts from 0 when you set MODE to UP_ONCE, UP_PER, or
// UPDWN_PER.
//
// When you write MODE all internally queued updates to [CHnCC.*] and TARGET
// clear.
// ENUMs:
// UPDWN_PER                Count up and down periodically. The timer counts
//                          from 0 to target value and back to 0,
//                          repeatedly.
//
//                          Period =  (target value *
//                          2) * timer clock period
// UP_PER                   Count up periodically. The timer increments from 0
//                          to target value, repeatedly.
//
//                          Period = (target value +
//                          1) * timer clock period
// UP_ONCE                  Count up once. The timer increments from 0 to
//                          target value,  then stops and sets MODE to DIS.
// DIS                      Disable timer. Updates to counter, channels, and
//                          events stop.
#define AUX_TIMER2_CTL_MODE_W                                                2
#define AUX_TIMER2_CTL_MODE_M                                       0x00000003
#define AUX_TIMER2_CTL_MODE_S                                                0
#define AUX_TIMER2_CTL_MODE_UPDWN_PER                               0x00000003
#define AUX_TIMER2_CTL_MODE_UP_PER                                  0x00000002
#define AUX_TIMER2_CTL_MODE_UP_ONCE                                 0x00000001
#define AUX_TIMER2_CTL_MODE_DIS                                     0x00000000

//*****************************************************************************
//
// Register: AUX_TIMER2_O_TARGET
//
//*****************************************************************************
// Field:  [15:0] VALUE
//
// 16 bit user defined counter target value, which is used when selected by
// CTL.TARGET_EN.
#define AUX_TIMER2_TARGET_VALUE_W                                           16
#define AUX_TIMER2_TARGET_VALUE_M                                   0x0000FFFF
#define AUX_TIMER2_TARGET_VALUE_S                                            0

//*****************************************************************************
//
// Register: AUX_TIMER2_O_SHDWTARGET
//
//*****************************************************************************
// Field:  [15:0] VALUE
//
// Target value for next counter period.
//
// The timer copies VALUE to TARGET.VALUE when CNTR.VALUE becomes 0. The copy
// does not happen when you restart the timer.
//
// This is useful to avoid period jitter in PWM applications with time-varying
// period, sometimes referenced as phase corrected PWM.
#define AUX_TIMER2_SHDWTARGET_VALUE_W                                       16
#define AUX_TIMER2_SHDWTARGET_VALUE_M                               0x0000FFFF
#define AUX_TIMER2_SHDWTARGET_VALUE_S                                        0

//*****************************************************************************
//
// Register: AUX_TIMER2_O_CNTR
//
//*****************************************************************************
// Field:  [15:0] VALUE
//
// 16 bit current counter value.
#define AUX_TIMER2_CNTR_VALUE_W                                             16
#define AUX_TIMER2_CNTR_VALUE_M                                     0x0000FFFF
#define AUX_TIMER2_CNTR_VALUE_S                                              0

//*****************************************************************************
//
// Register: AUX_TIMER2_O_PRECFG
//
//*****************************************************************************
// Field:   [7:0] CLKDIV
//
// Clock division.
//
// CLKDIV determines the timer clock frequency for counter, synchronization,
// and timer event updates. The timer clock frequency is the clock selected by
// AUX_SYSIF:TIMER2CLKCTL.SRC divided by (CLKDIV + 1). This inverse is the
// timer clock period.
//
// 0x00: Divide by 1.
// 0x01: Divide by 2.
// ...
// 0xFF: Divide by 256.
#define AUX_TIMER2_PRECFG_CLKDIV_W                                           8
#define AUX_TIMER2_PRECFG_CLKDIV_M                                  0x000000FF
#define AUX_TIMER2_PRECFG_CLKDIV_S                                           0

//*****************************************************************************
//
// Register: AUX_TIMER2_O_EVCTL
//
//*****************************************************************************
// Field:     [7] EV3_SET
//
// Set event 3.
//
// Write 1 to set event 3.
#define AUX_TIMER2_EVCTL_EV3_SET                                    0x00000080
#define AUX_TIMER2_EVCTL_EV3_SET_BITN                                        7
#define AUX_TIMER2_EVCTL_EV3_SET_M                                  0x00000080
#define AUX_TIMER2_EVCTL_EV3_SET_S                                           7

