TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_aux_timer2.h
// Field:     [6] EV3_CLR
//
// Clear event 3.
//
// Write 1 to clear event 3.
#define AUX_TIMER2_EVCTL_EV3_CLR                                    0x00000040
#define AUX_TIMER2_EVCTL_EV3_CLR_BITN                                        6
#define AUX_TIMER2_EVCTL_EV3_CLR_M                                  0x00000040
#define AUX_TIMER2_EVCTL_EV3_CLR_S                                           6

// Field:     [5] EV2_SET
//
// Set event 2.
//
// Write 1 to set event 2.
#define AUX_TIMER2_EVCTL_EV2_SET                                    0x00000020
#define AUX_TIMER2_EVCTL_EV2_SET_BITN                                        5
#define AUX_TIMER2_EVCTL_EV2_SET_M                                  0x00000020
#define AUX_TIMER2_EVCTL_EV2_SET_S                                           5

// Field:     [4] EV2_CLR
//
// Clear event 2.
//
// Write 1 to clear event 2.
#define AUX_TIMER2_EVCTL_EV2_CLR                                    0x00000010
#define AUX_TIMER2_EVCTL_EV2_CLR_BITN                                        4
#define AUX_TIMER2_EVCTL_EV2_CLR_M                                  0x00000010
#define AUX_TIMER2_EVCTL_EV2_CLR_S                                           4

// Field:     [3] EV1_SET
//
// Set event 1.
//
// Write 1 to set event 1.
#define AUX_TIMER2_EVCTL_EV1_SET                                    0x00000008
#define AUX_TIMER2_EVCTL_EV1_SET_BITN                                        3
#define AUX_TIMER2_EVCTL_EV1_SET_M                                  0x00000008
#define AUX_TIMER2_EVCTL_EV1_SET_S                                           3

// Field:     [2] EV1_CLR
//
// Clear event 1.
//
// Write 1 to clear event 1.
#define AUX_TIMER2_EVCTL_EV1_CLR                                    0x00000004
#define AUX_TIMER2_EVCTL_EV1_CLR_BITN                                        2
#define AUX_TIMER2_EVCTL_EV1_CLR_M                                  0x00000004
#define AUX_TIMER2_EVCTL_EV1_CLR_S                                           2

// Field:     [1] EV0_SET
//
// Set event 0.
//
// Write 1 to set event 0.
#define AUX_TIMER2_EVCTL_EV0_SET                                    0x00000002
#define AUX_TIMER2_EVCTL_EV0_SET_BITN                                        1
#define AUX_TIMER2_EVCTL_EV0_SET_M                                  0x00000002
#define AUX_TIMER2_EVCTL_EV0_SET_S                                           1

// Field:     [0] EV0_CLR
//
// Clear event 0.
//
// Write 1 to clear event 0.
#define AUX_TIMER2_EVCTL_EV0_CLR                                    0x00000001
#define AUX_TIMER2_EVCTL_EV0_CLR_BITN                                        0
#define AUX_TIMER2_EVCTL_EV0_CLR_M                                  0x00000001
#define AUX_TIMER2_EVCTL_EV0_CLR_S                                           0

//*****************************************************************************
//
// Register: AUX_TIMER2_O_PULSETRIG
//
//*****************************************************************************
// Field:     [0] TRIG
//
// Pulse trigger.
//
// Write 1 to generate a pulse to AUX_EVCTL:EVSTAT3.AUX_TIMER2_PULSE. Pulse
// width equals the duty cycle of AUX_SYSIF:TIMER2CLKCTL.SRC.
#define AUX_TIMER2_PULSETRIG_TRIG                                   0x00000001
#define AUX_TIMER2_PULSETRIG_TRIG_BITN                                       0
#define AUX_TIMER2_PULSETRIG_TRIG_M                                 0x00000001
#define AUX_TIMER2_PULSETRIG_TRIG_S                                          0

//*****************************************************************************
//
// Register: AUX_TIMER2_O_CH0EVCFG
//
//*****************************************************************************
// Field:     [7] EV3_GEN
//
// Event 3 enable.
//
// 0: Channel 0 does not control event 3.
// 1: Channel 0 controls event 3.
//
//  When 0 < CCACT < 8, EV3_GEN becomes zero after a capture or compare event.
#define AUX_TIMER2_CH0EVCFG_EV3_GEN                                 0x00000080
#define AUX_TIMER2_CH0EVCFG_EV3_GEN_BITN                                     7
#define AUX_TIMER2_CH0EVCFG_EV3_GEN_M                               0x00000080
#define AUX_TIMER2_CH0EVCFG_EV3_GEN_S                                        7

// Field:     [6] EV2_GEN
//
// Event 2 enable.
//
// 0: Channel 0 does not control event 2.
// 1: Channel 0 controls event 2.
//
//  When 0 < CCACT < 8, EV2_GEN becomes zero after a capture or compare event.
#define AUX_TIMER2_CH0EVCFG_EV2_GEN                                 0x00000040
#define AUX_TIMER2_CH0EVCFG_EV2_GEN_BITN                                     6
#define AUX_TIMER2_CH0EVCFG_EV2_GEN_M                               0x00000040
#define AUX_TIMER2_CH0EVCFG_EV2_GEN_S                                        6

// Field:     [5] EV1_GEN
//
// Event 1 enable.
//
// 0: Channel 0 does not control event 1.
// 1: Channel 0 controls event 1.
//
//  When 0 < CCACT < 8, EV1_GEN becomes zero after a capture or compare event.
#define AUX_TIMER2_CH0EVCFG_EV1_GEN                                 0x00000020
#define AUX_TIMER2_CH0EVCFG_EV1_GEN_BITN                                     5
#define AUX_TIMER2_CH0EVCFG_EV1_GEN_M                               0x00000020
#define AUX_TIMER2_CH0EVCFG_EV1_GEN_S                                        5

// Field:     [4] EV0_GEN
//
// Event 0 enable.
//
// 0: Channel 0 does not control event 0.
// 1: Channel 0 controls event 0.
//
//  When 0 < CCACT < 8, EV0_GEN becomes zero after a capture or compare event.
#define AUX_TIMER2_CH0EVCFG_EV0_GEN                                 0x00000010
#define AUX_TIMER2_CH0EVCFG_EV0_GEN_BITN                                     4
#define AUX_TIMER2_CH0EVCFG_EV0_GEN_M                               0x00000010
#define AUX_TIMER2_CH0EVCFG_EV0_GEN_S                                        4

// Field:   [3:0] CCACT
//
// Capture-Compare action.
//
// Capture-Compare action defines 15 different channel functions that utilize
// capture, compare, and zero events.
// ENUMs:
// PULSE_ON_CMP             Pulse on compare repeatedly.
//
//                          Channel function
//                          sequence:
//                          - Pulse enabled events
//                          when CH0CC.VALUE = CNTR.VALUE.
//
//                           The event is high for
//                          two timer clock periods.
// TGL_ON_CMP               Toggle on compare repeatedly.
//
//                          Channel function
//                          sequence:
//                          - Toggle enabled events
//                          when CH0CC.VALUE = CNTR.VALUE.
// SET_ON_CMP               Set on compare repeatedly.
//
//                          Channel function
//                          sequence:
//                          - Set enabled events
//                          when CH0CC.VALUE = CNTR.VALUE.
// CLR_ON_CMP               Clear on compare repeatedly.
//
//                          Channel function
//                          sequence:
//                          - Clear enabled events
//                          when CH0CC.VALUE = CNTR.VALUE.
// SET_ON_0_TGL_ON_CMP      Set on zero, toggle on compare repeatedly.
//
//                          Channel function
//                          sequence:
//                          - Set enabled events when
//                          CNTR.VALUE = 0.
//                          - Toggle enabled events
//                          when CH0CC.VALUE = CNTR.VALUE.
//
//                          Set CTL.MODE to UP_PER
//                          for edge-aligned PWM generation. Duty cycle is
//                          given by:
//
//                          When CH0CC.VALUE <=
//                          TARGET.VALUE:
//                             Duty cycle =
//                          CH0CC.VALUE / ( TARGET.VALUE + 1 ).
//
//                          When CH0CC.VALUE >
//                          TARGET.VALUE:
//                             Duty cycle = 1.
//
//                          Enabled events are
//                          cleared when CH0CC.VALUE = 0 and CNTR.VALUE =
//                          0.
// CLR_ON_0_TGL_ON_CMP      Clear on zero, toggle on compare repeatedly.
//
//                          Channel function
//                          sequence:
//                          - Clear enabled events
//                          when CNTR.VALUE = 0.
//                          - Toggle enabled events
//                          when CH0CC.VALUE = CNTR.VALUE.
//
//                          Set CTL.MODE to UPDWN_PER
//                          for center-aligned PWM generation. Duty cycle
//                          is given by:
//
//                          When CH0CC.VALUE <=
//                          TARGET.VALUE:
//                             Duty cycle = 1 - (
//                          CH0CC.VALUE / TARGET.VALUE ).
//
//                          When CH0CC.VALUE >
//                          TARGET.VALUE:
//                             Duty cycle = 0.
//
//                          Enabled events are set
//                          when CH0CC.VALUE = 0 and CNTR.VALUE = 0.
// SET_ON_CAPT              Set on capture repeatedly.
//
//                          Channel function
//                          sequence:
//                          - Set enabled events on
//                          capture event and copy CNTR.VALUE to
//                          CH0CC.VALUE.
//
//                          Primary use scenario is
//                          to select this function before you start the
//                          timer.
//                          Follow these steps if you
//                          need to select this function while CTL.MODE is
//                          different from DIS:
//                           - Select this function
//                          with no event enable.
//                           - Configure CH0CCFG
//                          (optional).
//                           - Wait for three timer
//                          clock periods as defined in PRECFG before you
//                          enable events.
//
//                          These steps prevent
//                          capture events caused by expired signal values
//                          in edge-detection circuit.
// PER_PULSE_WIDTH_MEAS     Period and pulse width measurement.
//
//                          Continuously capture
//                          period and pulse width of the signal selected
//                          by CH0CCFG.CAPT_SRC relative to the signal edge
//                          given by CH0CCFG.EDGE.
//
//                          Set enabled events when
//                          CH0CC.VALUE contains signal period and
//                          CH0PCC.VALUE contains signal pulse width.
//
//                          Notes:
//                          - Make sure that you
//                          configure CH0CCFG.CAPT_SRC and CCACT when
//                          CTL.MODE equals DIS, then set CTL.MODE to
//                          UP_ONCE or UP_PER.
//                          - The counter restarts in
//                          the selected timer mode when CH0CC.VALUE
//                          contains the signal period.
//                          - If more than one
//                          channel uses this function, the channels will
//                          perform this function one at a time. The
//                          channel with lowest number has priority and
//                          performs the function first. Next measurement
//                          starts when current measurement completes
//                          successfully or times out. A timeout occurs
//                          when counter equals target.
//                          - If you want to observe
//                          a timeout event configure another channel to
//                          SET_ON_CAPT.
//
//                          Signal property
//                          requirements:
//                          - Signal Period >= 2 * (
//                          1 + PRECFG.CLKDIV ) * timer clock period.
//                          - Signal Period <= 65535
//                          * (1 + PRECFG.CLKDIV ) * timer clock period.
//                          - Signal low and high
//                          phase >= (1 + PRECFG.CLKDIV ) * timer clock
//                          period.
// PULSE_ON_CMP_DIS         Pulse on compare, and then disable channel.
//
//                          Channel function
//                          sequence:
//                          - Pulse enabled events
//                          when CH0CC.VALUE = CNTR.VALUE.
//                          - Disable channel.
//
//                           The event is high for
//                          two timer clock periods.
// TGL_ON_CMP_DIS           Toggle on compare, and then disable channel.
//
//                          Channel function
//                          sequence:
//                          - Toggle enabled events
//                          when CH0CC.VALUE = CNTR.VALUE.
//                          - Disable channel.
// SET_ON_CMP_DIS           Set on compare, and then disable channel.
//
//                          Channel function
//                          sequence:
//                          - Set enabled events when
//                          CH0CC.VALUE = CNTR.VALUE.
//                          - Disable channel.
// CLR_ON_CMP_DIS           Clear on compare, and then disable channel.
//
//                          Channel function
//                          sequence:
//                          - Clear enabled events
//                          when CH0CC.VALUE = CNTR.VALUE.
//                          - Disable channel.
// SET_ON_0_TGL_ON_CMP_DIS  Set on zero, toggle on compare, and then disable
//                          channel.
//
//                          Channel function
//                          sequence:
//                          - Set enabled events when
//                          CNTR.VALUE = 0.
//                          - Toggle enabled events
//                          when CH0CC.VALUE = CNTR.VALUE.
//                          - Disable channel.
//
//                          Enabled events are
//                          cleared when CH0CC.VALUE = 0 and CNTR.VALUE =
//                          0.
// CLR_ON_0_TGL_ON_CMP_DIS  Clear on zero, toggle on compare, and then disable
//                          channel.
//
//                          Channel function
//                          sequence:
//                          - Clear enabled events
//                          when CNTR.VALUE = 0.
//                          - Toggle enabled events
//                          when CH0CC.VALUE = CNTR.VALUE.
//                          - Disable channel.
//
//                          Enabled events are set
//                          when CH0CC.VALUE = 0 and CNTR.VALUE = 0.
// SET_ON_CAPT_DIS          Set on capture, and then disable channel.
//
//                          Channel function
//                          sequence:
//                          - Set enabled events on
//                          capture event and copy CNTR.VALUE to
//                          CH0CC.VALUE.
//                          - Disable channel.
//
//                          Primary use scenario is
//                          to select this function before you start the
//                          timer.
//                          Follow these steps if you
//                          need to select this function while CTL.MODE is
//                          different from DIS:
//                           - Set CCACT to
//                          SET_ON_CAPT with no event enable.
//                           - Configure CH0CCFG
//                          (optional).
//                           - Wait for three timer
//                          clock periods as defined in PRECFG before you
//                          set CCACT to SET_ON_CAPT_DIS. Event enable is
//                          optional.
//
//                          These steps prevent
//                          capture events caused by expired signal values
//                          in edge-detection circuit.
// DIS                      Disable channel.
#define AUX_TIMER2_CH0EVCFG_CCACT_W                                          4
#define AUX_TIMER2_CH0EVCFG_CCACT_M                                 0x0000000F
#define AUX_TIMER2_CH0EVCFG_CCACT_S                                          0
#define AUX_TIMER2_CH0EVCFG_CCACT_PULSE_ON_CMP                      0x0000000F
#define AUX_TIMER2_CH0EVCFG_CCACT_TGL_ON_CMP                        0x0000000E
#define AUX_TIMER2_CH0EVCFG_CCACT_SET_ON_CMP                        0x0000000D
#define AUX_TIMER2_CH0EVCFG_CCACT_CLR_ON_CMP                        0x0000000C
#define AUX_TIMER2_CH0EVCFG_CCACT_SET_ON_0_TGL_ON_CMP               0x0000000B
#define AUX_TIMER2_CH0EVCFG_CCACT_CLR_ON_0_TGL_ON_CMP               0x0000000A
#define AUX_TIMER2_CH0EVCFG_CCACT_SET_ON_CAPT                       0x00000009
#define AUX_TIMER2_CH0EVCFG_CCACT_PER_PULSE_WIDTH_MEAS              0x00000008
#define AUX_TIMER2_CH0EVCFG_CCACT_PULSE_ON_CMP_DIS                  0x00000007
#define AUX_TIMER2_CH0EVCFG_CCACT_TGL_ON_CMP_DIS                    0x00000006
#define AUX_TIMER2_CH0EVCFG_CCACT_SET_ON_CMP_DIS                    0x00000005
#define AUX_TIMER2_CH0EVCFG_CCACT_CLR_ON_CMP_DIS                    0x00000004
#define AUX_TIMER2_CH0EVCFG_CCACT_SET_ON_0_TGL_ON_CMP_DIS           0x00000003
#define AUX_TIMER2_CH0EVCFG_CCACT_CLR_ON_0_TGL_ON_CMP_DIS           0x00000002
#define AUX_TIMER2_CH0EVCFG_CCACT_SET_ON_CAPT_DIS                   0x00000001
#define AUX_TIMER2_CH0EVCFG_CCACT_DIS                               0x00000000

