TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_aux_timer2.h
// Field:   [3:0] CCACT
//
// Capture-Compare action.
//
// Capture-Compare action defines 15 different channel functions that utilize
// capture, compare, and zero events.
// ENUMs:
// PULSE_ON_CMP             Pulse on compare repeatedly.
//
//                          Channel function
//                          sequence:
//                          - Pulse enabled events
//                          when CH3CC.VALUE = CNTR.VALUE.
//
//                           The event is high for
//                          two timer clock periods.
// TGL_ON_CMP               Toggle on compare repeatedly.
//
//                          Channel function
//                          sequence:
//                          - Toggle enabled events
//                          when CH3CC.VALUE = CNTR.VALUE.
// SET_ON_CMP               Set on compare repeatedly.
//
//                          Channel function
//                          sequence:
//                          - Set enabled events
//                          when CH3CC.VALUE = CNTR.VALUE.
// CLR_ON_CMP               Clear on compare repeatedly.
//
//                          Channel function
//                          sequence:
//                          - Clear enabled events
//                          when CH3CC.VALUE = CNTR.VALUE.
// SET_ON_0_TGL_ON_CMP      Set on zero, toggle on compare repeatedly.
//
//                          Channel function
//                          sequence:
//                          - Set enabled events when
//                          CNTR.VALUE = 0.
//                          - Toggle enabled events
//                          when CH3CC.VALUE = CNTR.VALUE.
//
//                          Set CTL.MODE to UP_PER
//                          for edge-aligned PWM generation. Duty cycle is
//                          given by:
//
//                          When CH3CC.VALUE <=
//                          TARGET.VALUE:
//                             Duty cycle =
//                          CH3CC.VALUE / ( TARGET.VALUE + 1 ).
//
//                          When CH3CC.VALUE >
//                          TARGET.VALUE:
//                             Duty cycle = 1.
//
//                          Enabled events are
//                          cleared when CH3CC.VALUE = 0 and CNTR.VALUE =
//                          0.
// CLR_ON_0_TGL_ON_CMP      Clear on zero, toggle on compare repeatedly.
//
//                          Channel function
//                          sequence:
//                          - Clear enabled events
//                          when CNTR.VALUE = 0.
//                          - Toggle enabled events
//                          when CH3CC.VALUE = CNTR.VALUE.
//
//                          Set CTL.MODE to UPDWN_PER
//                          for center-aligned PWM generation. Duty cycle
//                          is given by:
//
//                          When CH3CC.VALUE <=
//                          TARGET.VALUE:
//                             Duty cycle = 1 - (
//                          CH3CC.VALUE / TARGET.VALUE ).
//
//                          When CH3CC.VALUE >
//                          TARGET.VALUE:
//                             Duty cycle = 0.
//
//                          Enabled events are set
//                          when CH3CC.VALUE = 0 and CNTR.VALUE = 0.
// SET_ON_CAPT              Set on capture repeatedly.
//
//                          Channel function
//                          sequence:
//                          - Set enabled events on
//                          capture event and copy CNTR.VALUE to
//                          CH3CC.VALUE.
//
//                          Primary use scenario is
//                          to select this function before you start the
//                          timer.
//                          Follow these steps if you
//                          need to select this function while CTL.MODE is
//                          different from DIS:
//                           - Select this function
//                          with no event enable.
//                           - Configure CH3CCFG
//                          (optional).
//                           - Wait for three timer
//                          clock periods as defined in PRECFG before you
//                          enable events.
//
//                          These steps prevent
//                          capture events caused by expired signal values
//                          in edge-detection circuit.
// PER_PULSE_WIDTH_MEAS     Period and pulse width measurement.
//
//                          Continuously capture
//                          period and pulse width of the signal selected
//                          by CH3CCFG.CAPT_SRC relative to the signal edge
//                          given by CH3CCFG.EDGE.
//
//                          Set enabled events when
//                          CH3CC.VALUE contains signal period and
//                          CH3PCC.VALUE contains signal pulse width.
//
//                          Notes:
//                          - Make sure that you
//                          configure CH3CCFG.CAPT_SRC and CCACT when
//                          CTL.MODE equals DIS, then set CTL.MODE to
//                          UP_ONCE or UP_PER.
//                          - The counter restarts in
//                          the selected timer mode when CH3CC.VALUE
//                          contains the signal period.
//                          - If more than one
//                          channel uses this function, the channels will
//                          perform this function one at a time. The
//                          channel with lowest number has priority and
//                          performs the function first. Next measurement
//                          starts when current measurement completes
//                          successfully or times out. A timeout occurs
//                          when counter equals target.
//                          - If you want to observe
//                          a timeout event configure another channel to
//                          SET_ON_CAPT.
//
//                          Signal property
//                          requirements:
//                          - Signal Period >= 2 * (
//                          1 + PRECFG.CLKDIV ) * timer clock period.
//                          - Signal Period <= 65535
//                          * (1 + PRECFG.CLKDIV ) * timer clock period.
//                          - Signal low and high
//                          phase >= (1 + PRECFG.CLKDIV ) * timer clock
//                          period.
// PULSE_ON_CMP_DIS         Pulse on compare, and then disable channel.
//
//                          Channel function
//                          sequence:
//                          - Pulse enabled events
//                          when CH3CC.VALUE = CNTR.VALUE.
//                          - Disable channel.
//
//                           The event is high for
//                          two timer clock periods.
// TGL_ON_CMP_DIS           Toggle on compare, and then disable channel.
//
//                          Channel function
//                          sequence:
//                          - Toggle enabled events
//                          when CH3CC.VALUE = CNTR.VALUE.
//                          - Disable channel.
// SET_ON_CMP_DIS           Set on compare, and then disable channel.
//
//                          Channel function
//                          sequence:
//                          - Set enabled events when
//                          CH3CC.VALUE = CNTR.VALUE.
//                          - Disable channel.
// CLR_ON_CMP_DIS           Clear on compare, and then disable channel.
//
//                          Channel function
//                          sequence:
//                          - Clear enabled events
//                          when CH3CC.VALUE = CNTR.VALUE.
//                          - Disable channel.
// SET_ON_0_TGL_ON_CMP_DIS  Set on zero, toggle on compare, and then disable
//                          channel.
//
//                          Channel function
//                          sequence:
//                          - Set enabled events when
//                          CNTR.VALUE = 0.
//                          - Toggle enabled events
//                          when CH3CC.VALUE = CNTR.VALUE.
//                          - Disable channel.
//
//                          Enabled events are
//                          cleared when CH3CC.VALUE = 0 and CNTR.VALUE =
//                          0.
// CLR_ON_0_TGL_ON_CMP_DIS  Clear on zero, toggle on compare, and then disable
//                          channel.
//
//                          Channel function
//                          sequence:
//                          - Clear enabled events
//                          when CNTR.VALUE = 0.
//                          - Toggle enabled events
//                          when CH3CC.VALUE = CNTR.VALUE.
//                          - Disable channel.
//
//                          Enabled events are set
//                          when CH3CC.VALUE = 0 and CNTR.VALUE = 0.
// SET_ON_CAPT_DIS          Set on capture, and then disable channel.
//
//                          Channel function
//                          sequence:
//                          - Set enabled events on
//                          capture event and copy CNTR.VALUE to
//                          CH3CC.VALUE.
//                          - Disable channel.
//
//                          Primary use scenario is
//                          to select this function before you start the
//                          timer.
//                          Follow these steps if you
//                          need to select this function while CTL.MODE is
//                          different from DIS:
//                           - Set CCACT to
//                          SET_ON_CAPT with no event enable.
//                           - Configure CH3CCFG
//                          (optional).
//                           - Wait for three timer
//                          clock periods as defined in PRECFG before you
//                          set CCACT to SET_ON_CAPT_DIS.  Event enable is
//                          optional.
//
//                          These steps prevent
//                          capture events caused by expired signal values
//                          in edge-detection circuit.
// DIS                      Disable channel.
#define AUX_TIMER2_CH3EVCFG_CCACT_W                                          4
#define AUX_TIMER2_CH3EVCFG_CCACT_M                                 0x0000000F
#define AUX_TIMER2_CH3EVCFG_CCACT_S                                          0
#define AUX_TIMER2_CH3EVCFG_CCACT_PULSE_ON_CMP                      0x0000000F
#define AUX_TIMER2_CH3EVCFG_CCACT_TGL_ON_CMP                        0x0000000E
#define AUX_TIMER2_CH3EVCFG_CCACT_SET_ON_CMP                        0x0000000D
#define AUX_TIMER2_CH3EVCFG_CCACT_CLR_ON_CMP                        0x0000000C
#define AUX_TIMER2_CH3EVCFG_CCACT_SET_ON_0_TGL_ON_CMP               0x0000000B
#define AUX_TIMER2_CH3EVCFG_CCACT_CLR_ON_0_TGL_ON_CMP               0x0000000A
#define AUX_TIMER2_CH3EVCFG_CCACT_SET_ON_CAPT                       0x00000009
#define AUX_TIMER2_CH3EVCFG_CCACT_PER_PULSE_WIDTH_MEAS              0x00000008
#define AUX_TIMER2_CH3EVCFG_CCACT_PULSE_ON_CMP_DIS                  0x00000007
#define AUX_TIMER2_CH3EVCFG_CCACT_TGL_ON_CMP_DIS                    0x00000006
#define AUX_TIMER2_CH3EVCFG_CCACT_SET_ON_CMP_DIS                    0x00000005
#define AUX_TIMER2_CH3EVCFG_CCACT_CLR_ON_CMP_DIS                    0x00000004
#define AUX_TIMER2_CH3EVCFG_CCACT_SET_ON_0_TGL_ON_CMP_DIS           0x00000003
#define AUX_TIMER2_CH3EVCFG_CCACT_CLR_ON_0_TGL_ON_CMP_DIS           0x00000002
#define AUX_TIMER2_CH3EVCFG_CCACT_SET_ON_CAPT_DIS                   0x00000001
#define AUX_TIMER2_CH3EVCFG_CCACT_DIS                               0x00000000

//*****************************************************************************
//
// Register: AUX_TIMER2_O_CH3CCFG
//
//*****************************************************************************
// Field:   [6:1] CAPT_SRC
//
// Select capture signal source from the asynchronous AUX event bus.
//
// The selected signal enters the edge-detection circuit. False capture events
// can occur when:
// - the edge-detection circuit contains expired signal samples and the circuit
// is enabled without flush as described in CH3EVCFG
// - this register is reconfigured while CTL.MODE is different from DIS.
//
// You can avoid false capture events. When wanted channel function:
// - SET_ON_CAPT_DIS, see description for SET_ON_CAPT_DIS in CH3EVCFG.CCACT.
// - SET_ON_CAPT, see description for SET_ON_CAPT in CH3EVCFG.CCACT.
// - PER_PULSE_WIDTH_MEAS, see description for PER_PULSE_WIDTH_MEAS in
// CH3EVCFG.CCACT.
//
// If you write a non-enumerated value the behavior is identical to NO_EVENT.
// The written value is returned when read.
// ENUMs:
// NO_EVENT                 No event.
// AUX_SMPH_AUTOTAKE_DONE   AUX_EVCTL:EVSTAT3.AUX_SMPH_AUTOTAKE_DONE
// AUX_ADC_FIFO_NOT_EMPTY   AUX_EVCTL:EVSTAT3.AUX_ADC_FIFO_NOT_EMPTY
// AUX_ADC_FIFO_ALMOST_FULL AUX_EVCTL:EVSTAT3.AUX_ADC_FIFO_ALMOST_FULL
// AUX_ADC_IRQ              AUX_EVCTL:EVSTAT3.AUX_ADC_IRQ
// AUX_ADC_DONE             AUX_EVCTL:EVSTAT3.AUX_ADC_DONE
// AUX_ISRC_RESET_N         AUX_EVCTL:EVSTAT3.AUX_ISRC_RESET_N
// AUX_TDC_DONE             AUX_EVCTL:EVSTAT3.AUX_TDC_DONE
// AUX_TIMER0_EV            AUX_EVCTL:EVSTAT3.AUX_TIMER0_EV
// AUX_TIMER1_EV            AUX_EVCTL:EVSTAT3.AUX_TIMER1_EV
// AUX_TIMER2_EV3           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3
// AUX_TIMER2_EV2           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2
// AUX_TIMER2_EV1           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1
// AUX_TIMER2_EV0           AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0
// AUX_COMPB                AUX_EVCTL:EVSTAT2.AUX_COMPB
// AUX_COMPA                AUX_EVCTL:EVSTAT2.AUX_COMPA
// MCU_OBSMUX1              AUX_EVCTL:EVSTAT2.MCU_OBSMUX1
// MCU_OBSMUX0              AUX_EVCTL:EVSTAT2.MCU_OBSMUX0
// MCU_EV                   AUX_EVCTL:EVSTAT2.MCU_EV
// ACLK_REF                 AUX_EVCTL:EVSTAT2.ACLK_REF
// VDDR_RECHARGE            AUX_EVCTL:EVSTAT2.VDDR_RECHARGE
// MCU_ACTIVE               AUX_EVCTL:EVSTAT2.MCU_ACTIVE
// PWR_DWN                  AUX_EVCTL:EVSTAT2.PWR_DWN
// SCLK_LF                  AUX_EVCTL:EVSTAT2.SCLK_LF
// AON_BATMON_TEMP_UPD      AUX_EVCTL:EVSTAT2.AON_BATMON_TEMP_UPD
// AON_BATMON_BAT_UPD       AUX_EVCTL:EVSTAT2.AON_BATMON_BAT_UPD
// AON_RTC_4KHZ             AUX_EVCTL:EVSTAT2.AON_RTC_4KHZ
// AON_RTC_CH2_DLY          AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY
// AON_RTC_CH2              AUX_EVCTL:EVSTAT2.AON_RTC_CH2
// MANUAL_EV                AUX_EVCTL:EVSTAT2.MANUAL_EV
// AUXIO31                  AUX_EVCTL:EVSTAT1.AUXIO31
// AUXIO30                  AUX_EVCTL:EVSTAT1.AUXIO30
// AUXIO29                  AUX_EVCTL:EVSTAT1.AUXIO29
// AUXIO28                  AUX_EVCTL:EVSTAT1.AUXIO28
// AUXIO27                  AUX_EVCTL:EVSTAT1.AUXIO27
// AUXIO26                  AUX_EVCTL:EVSTAT1.AUXIO26
// AUXIO25                  AUX_EVCTL:EVSTAT1.AUXIO25
// AUXIO24                  AUX_EVCTL:EVSTAT1.AUXIO24
// AUXIO23                  AUX_EVCTL:EVSTAT1.AUXIO23
// AUXIO22                  AUX_EVCTL:EVSTAT1.AUXIO22
// AUXIO21                  AUX_EVCTL:EVSTAT1.AUXIO21
// AUXIO20                  AUX_EVCTL:EVSTAT1.AUXIO20
// AUXIO19                  AUX_EVCTL:EVSTAT1.AUXIO19
// AUXIO18                  AUX_EVCTL:EVSTAT1.AUXIO18
// AUXIO17                  AUX_EVCTL:EVSTAT1.AUXIO17
// AUXIO16                  AUX_EVCTL:EVSTAT1.AUXIO16
// AUXIO15                  AUX_EVCTL:EVSTAT0.AUXIO15
// AUXIO14                  AUX_EVCTL:EVSTAT0.AUXIO14
// AUXIO13                  AUX_EVCTL:EVSTAT0.AUXIO13
// AUXIO12                  AUX_EVCTL:EVSTAT0.AUXIO12
// AUXIO11                  AUX_EVCTL:EVSTAT0.AUXIO11
// AUXIO10                  AUX_EVCTL:EVSTAT0.AUXIO10
// AUXIO9                   AUX_EVCTL:EVSTAT0.AUXIO9
// AUXIO8                   AUX_EVCTL:EVSTAT0.AUXIO8
// AUXIO7                   AUX_EVCTL:EVSTAT0.AUXIO7
// AUXIO6                   AUX_EVCTL:EVSTAT0.AUXIO6
// AUXIO5                   AUX_EVCTL:EVSTAT0.AUXIO5
// AUXIO4                   AUX_EVCTL:EVSTAT0.AUXIO4
// AUXIO3                   AUX_EVCTL:EVSTAT0.AUXIO3
// AUXIO2                   AUX_EVCTL:EVSTAT0.AUXIO2
// AUXIO1                   AUX_EVCTL:EVSTAT0.AUXIO1
// AUXIO0                   AUX_EVCTL:EVSTAT0.AUXIO0
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_W                                        6
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_M                               0x0000007E
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_S                                        1
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_NO_EVENT                        0x0000007E
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUX_SMPH_AUTOTAKE_DONE          0x0000007A
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUX_ADC_FIFO_NOT_EMPTY          0x00000078
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUX_ADC_FIFO_ALMOST_FULL        0x00000076
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUX_ADC_IRQ                     0x00000074
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUX_ADC_DONE                    0x00000072
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUX_ISRC_RESET_N                0x00000070
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUX_TDC_DONE                    0x0000006E
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUX_TIMER0_EV                   0x0000006C
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUX_TIMER1_EV                   0x0000006A
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUX_TIMER2_EV3                  0x00000066
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUX_TIMER2_EV2                  0x00000064
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUX_TIMER2_EV1                  0x00000062
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUX_TIMER2_EV0                  0x00000060
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUX_COMPB                       0x0000005E
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUX_COMPA                       0x0000005C
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_MCU_OBSMUX1                     0x0000005A
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_MCU_OBSMUX0                     0x00000058
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_MCU_EV                          0x00000056
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_ACLK_REF                        0x00000054
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_VDDR_RECHARGE                   0x00000052
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_MCU_ACTIVE                      0x00000050
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_PWR_DWN                         0x0000004E
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_SCLK_LF                         0x0000004C
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AON_BATMON_TEMP_UPD             0x0000004A
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AON_BATMON_BAT_UPD              0x00000048
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AON_RTC_4KHZ                    0x00000046
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AON_RTC_CH2_DLY                 0x00000044
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AON_RTC_CH2                     0x00000042
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_MANUAL_EV                       0x00000040
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO31                         0x0000003E
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO30                         0x0000003C
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO29                         0x0000003A
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO28                         0x00000038
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO27                         0x00000036
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO26                         0x00000034
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO25                         0x00000032
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO24                         0x00000030
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO23                         0x0000002E
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO22                         0x0000002C
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO21                         0x0000002A
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO20                         0x00000028
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO19                         0x00000026
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO18                         0x00000024
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO17                         0x00000022
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO16                         0x00000020
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO15                         0x0000001E
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO14                         0x0000001C
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO13                         0x0000001A
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO12                         0x00000018
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO11                         0x00000016
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO10                         0x00000014
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO9                          0x00000012
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO8                          0x00000010
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO7                          0x0000000E
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO6                          0x0000000C
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO5                          0x0000000A
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO4                          0x00000008
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO3                          0x00000006
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO2                          0x00000004
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO1                          0x00000002
#define AUX_TIMER2_CH3CCFG_CAPT_SRC_AUXIO0                          0x00000000

// Field:     [0] EDGE
//
// Edge configuration.
//
// Channel captures counter value at selected edge on signal source selected by
// CAPT_SRC. See CH3EVCFG.CCACT.
// ENUMs:
// RISING                   Capture CNTR.VALUE at rising edge of CAPT_SRC.
// FALLING                  Capture CNTR.VALUE at falling edge of CAPT_SRC.
#define AUX_TIMER2_CH3CCFG_EDGE                                     0x00000001
#define AUX_TIMER2_CH3CCFG_EDGE_BITN                                         0
#define AUX_TIMER2_CH3CCFG_EDGE_M                                   0x00000001
#define AUX_TIMER2_CH3CCFG_EDGE_S                                            0
#define AUX_TIMER2_CH3CCFG_EDGE_RISING                              0x00000001
#define AUX_TIMER2_CH3CCFG_EDGE_FALLING                             0x00000000

