TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_aux_timer2.h
//*****************************************************************************
//
// Register: AUX_TIMER2_O_CH3PCC
//
//*****************************************************************************
// Field:  [15:0] VALUE
//
// Pipeline Capture Compare value.
//
// 16-bit user defined pipeline compare value or channel-updated capture value.
//
// Compare mode:
// An update of VALUE will be transferred to CH3CC.VALUE when the next
// CNTR.VALUE is zero and CTL.MODE is different from DIS. This is useful for
// PWM generation and prevents jitter on the edges of the generated signal.
//
// Capture mode:
// When CH3EVCFG.CCACT equals PER_PULSE_WIDTH_MEAS then VALUE contains the
// width of the low or high phase of the selected signal. This is specified by
// CH3CCFG.EDGE and CH3CCFG.CAPT_SRC.
#define AUX_TIMER2_CH3PCC_VALUE_W                                           16
#define AUX_TIMER2_CH3PCC_VALUE_M                                   0x0000FFFF
#define AUX_TIMER2_CH3PCC_VALUE_S                                            0

//*****************************************************************************
//
// Register: AUX_TIMER2_O_CH3CC
//
//*****************************************************************************
// Field:  [15:0] VALUE
//
// Capture Compare value.
//
// 16-bit user defined compare value or channel-updated capture value.
//
// Compare mode:
// VALUE is compared against CNTR.VALUE and an event is generated as specified
// by CH3EVCFG.CCACT when these are equal.
//
// Capture mode:
// The current counter value is stored in VALUE when a capture event occurs.
// CH3EVCFG.CCACT determines if VALUE is a signal period or a regular capture
// value.
#define AUX_TIMER2_CH3CC_VALUE_W                                            16
#define AUX_TIMER2_CH3CC_VALUE_M                                    0x0000FFFF
#define AUX_TIMER2_CH3CC_VALUE_S                                             0


#endif // __AUX_TIMER2__
